Repository: digideskio/ikiwiki
Catalog: po/underlays/directives/ikiwiki/directive/aggregate.*.po
Languages: cs

source: The `aggregate` directive is supplied by the [[!iki plugins/aggregate desc=aggregate]] plugin. This plugin requires extra setup, specifically, a cron job. See the plugin's documentation for details.
cs: Direktiva `aggregate` je poskytována modulem [[!iki plugins/aggregate desc=aggregate]]. Tento modul vyžaduje speciální nastavení, konkrétně cronovou úlohu. Podrobnosti naleznete v dokumentaci k modulu.

source: This directive allows content from other feeds to be aggregated into the wiki. Aggregate a feed as follows:
cs: Tato direktiva umožňuje ve wiki agregovat obsah z jiných zdrojů. Zdroj (kanál) přidáte následovně:

source: \[[!aggregate name="example blog" dir="example" feedurl="http://example.com/index.rss" url="http://example.com/" updateinterval="15"]]
cs: \[[!aggregate name="testovací blog" dir="example" feedurl="http://example.com/index.rss" url="http://example.com/" updateinterval="15"]]

source: That example aggregates posts from the specified RSS feed, updating no more frequently than once every 15 minutes (though possibly less frequently, if the cron job runs less frequently than that), and puts a page per post under the example/ directory in the wiki.
cs: Příklad agreguje články ze zadaného RSS kanálu, aktualizuje se každých patnáct minut (nejspíše však méně často, protože cronová úloha může běžet v delších intervalech) a každý článek uloží do wiki do samostatné stránky v adresáři example/.

source: You can then use ikiwiki's [[inline]] directive to create a blog of one or more aggregated feeds. For example:
cs: Agregovaný kanál (nebo kanály) pak můžete direktivou [[inline]] proměnit v blog. Například:

source: Note the use of `internal()` in the [[ikiwiki/PageSpec]] to match aggregated pages. By default, aggregated pages are internal pages, which prevents them from showing up directly in the wiki, and so this special [[PageSpec]] is needed to match them.
cs: Povšimněte si použití funkce `internal()` při [[specifikování stránek|ikiwiki/PageSpec]]. Agregované stránky jsou totiž implicitně chápány jako interní a proto se nezobrazí ve wiki přímo, ale je nutno použít speciální [[PageSpec]].

source: usage
cs: Použití

source: Here are descriptions of all the supported parameters to the `aggregate` directive:
cs: Zde je popis všech parametrů podporovaných direktivou `aggregate`:

source: `name` - A name for the feed. Each feed must have a unique name. Required.
cs: `name` - Název kanálu. Každý kanál musí mít jedinečný název. Povinné.

source: `url` - The url to the web page for the feed that's being aggregated. Required.
cs: `url` - URL webové stránky s kanálem, který se má agregovat. Povinné.

source: `dir` - The directory in the wiki where pages should be saved. Optional, if not specified, the directory is based on the name of the feed.
cs: `dir` - Adresář ve wiki, kam se mají ukládat agregované stránky. Volitelné. Pokud není zadán, bude jmého adresáře odvozeno z názvu kanálu.

source: `feedurl` - The url to the feed. Optional, if it's not specified ikiwiki will look for feeds on the `url`. RSS and atom feeds are supported.
cs: `feedurl` - URL kanálu. Volitelné, pokud není zadáno, bude ikiwiki hledat kanály na `url`. Podporovány jsou kanály typu RSS a atom.

source: `updateinterval` - How often to check for new posts, in minutes. Default is 15 minutes.
cs: `updateinterval` - Jak často se mají zjišťovat nové články (v minutách). Výchozí hodnota je 15 minut.

source: `expireage` - Expire old items from this feed if they are older than a specified number of days. Default is to never expire on age.
cs: `expireage` - Odstraní staré články z tohoto kanálu pokud jsou starší než zadaný počet dnů. Ve výchozím nastavení se nikdy nemaže podle stáří.

source: `expirecount` - Expire old items from this feed if there are more than the specified number total. Oldest items will be expired first. Default is to never expire on count.
cs: `expirecount` - Odstraní staré články z tohoto kanálu pokud je jich více než zadaný počet. Nejprve budou mazány nejstarší články. Ve výchozím nastavení se nikdy nemaže podle počtu článků.

source: `tag` - A tag to tag each post from the feed with. A good tag to use is the name of the feed. Can be repeated multiple times. The [[tag]] plugin must be enabled for this to work.
cs: `tag` - Štítek, který se přilepí na všechny články z tohoto kanálu. Dobrý štítek bývá název kanálu. Parametr `tag` je možné použít víckrát. Aby štítkování fungovalo, musí být povolen modul [[tag]].

source: `template` - Template to use for creating the aggregated pages. Defaults to aggregatepost.
cs: `template` - Šablona, která se má použít pro vytvoření agregovaných stránek. Výchozí hodnota je „aggregatepost“.

source: Note that even if you are using subversion or another revision control system, pages created by aggregation will *not* be checked into revision control.
cs: Pozor na to, že i když používáte subversion, nebo nějaký jiný systém pro správu verzí, *nebudou* stránky vytvořené při agregaci uloženy do repositáře.
