Repository: digideskio/ikiwiki
Catalog: po/underlays/directives/ikiwiki/directive/calendar.*.po
Languages: cs

source: The `calendar` directive is supplied by the [[!iki plugins/calendar desc=calendar]] plugin. This plugin requires extra setup. See the plugin documentation for details.
cs: Direktiva `calendar` je poskytována modulem [[!iki plugins/calendar desc=calendar]]. Tento modul vyžaduje speciální nastavení, podrobnosti naleznete v dokumentaci k modulu.

source: This directive displays a calendar, similar to the typical calendars shown on some blogs.
cs: Tato direktiva zobrazí kalendář podobný typickým kalendářům na některých blozích.

source: examples
cs: Příklady

source: The calendar is essentially a fancy front end to archives of previous pages, usually used for blogs. It can produce a calendar for a given month, or a list of months for a given year.
cs: Kalendář je v podstatě rozhraní k archivu předchozích stránek používané obvykle u blogů. Umí vyrobit kalendář zadaného měsíce nebo měsíců v zadaném roce.

source: The month format calendar simply links to any page posted on each day of the month. The year format calendar links to archive pages, with names like `archives/2007` (for all of 2007) and `archives/2007/01` (for January, 2007). For this to work, you'll need to create these archive pages. They typically use [[inline]] to display or list pages created in the given time frame.
cs: Měsíční formát kalendáře jednoduše odkazuje na stránky vytvořené daný den měsíce. Roční formát kalendáře se odkazuje na archivní stránky se jmény jako `archivy/2007` (pro celý rok 2007) a `archivy/2007/01` (pro leden 2007). Aby to však fungovalo, musíte tyto archivní stránky vytvořit. Archivní stránky budou pro zobrazení seznamu stránek v daném období nejspíše používat direktivu [[inline]].

source: usage
cs: Použití

source: `type` - Used to specify the type of calendar wanted. Can be one of "month" or "year". The default is a month view calendar.
cs: `type` - Určuje typ kalendáře, který se má použít. Může nabývat hodnoty „month“ nebo „year“. Výchozí je měsíční kalendář.

source: `pages` - Specifies the [[ikiwiki/PageSpec]] of pages to link to from the month calendar. Defaults to "*".
cs: `pages` - Pomocí [[ikiwiki/PageSpec]] vybírá stránky, na které má měsíční kalendář odkazovat. Výchozí hodnota je „*“.

source: `archivebase` - Configures the base of the archives hierarchy. The default is "archives". Note that this default can also be overridden for the whole wiki by setting `archivebase` in ikiwiki's setup file.
cs: `archivebase` - Nastaví počáteční adresář hierarchie archivu. Výchozí je „archives“. Výchozí hodnotu lze změnit také globálně pro celou wiki nastavením parametru `archivebase` v konfiguračním souboru ikiwiki.

source: `year` - The year for which the calendar is requested. Defaults to the current year.
cs: `year` - Rok, pro který je kalendář vyžadován. Výchozí je aktuální rok.

source: `month` - The numeric month for which the calendar is requested, in the range 1..12. Used only for the month view calendar, and defaults to the current month.
cs: `month` - Číselné označení měsíce (v rozsahu 1..12), pro který je kalendář vyžadován. Používá se pouze při měsíčním pohledu a výchozí hodnotou je aktuální měsíc.

source: `week_start_day` - A number, in the range 0..6, which represents the day of the week that the month calendar starts with. 0 is Sunday, 1 is Monday, and so on. Defaults to 0, which is Sunday.
cs: `week_start_day` - Číslo z rozsahu 0..6, které reprezentuje den v týdnu, kterým má týden začínat. 0 je neděle, 1 je pondělí, atd. Výchozí hodnotou je 0 (neděle).

source: `months_per_row` - In the annual calendar, number of months to place in each row. Defaults to 3.
cs: `months_per_row` - Počet měsíců, které se mají v ročním kalendáři zobrazit na jednom řádku. Výchozí hodnota je 3.
