Repository: digideskio/ikiwiki
Catalog: po/underlays/directives/ikiwiki/directive/color.*.po
Languages: cs

source: The `color` directive is supplied by the [[!iki plugins/color desc=color]] plugin.
cs: Direktiva `color` je poskytována modulem [[!iki plugins/color desc=color]].

source: This directive can be used to color a piece of text on a page. It can be used to set the foreground and/or background color of the text.
cs: Tuto direktivu můžete použít pro obarvení části textu na stránce. Je možné nastavit barvu popředí i pozadí textu.

source: You can use a color name (e.g. `white`) or HTML code (e.g. `#ffffff`) to define colors.
cs: Barvy můžete definovat jejich anglickým jménem (např. `white`) nebo HTML kódem (např. `#ffffff`).

source: examples
cs: Příklady

source: Here the foreground color is defined as a word, while the background color is defined as a HTML color code:
cs: Zde je barva popředí definována slovně, barva pozadí HTML kódem:

source: \[[!color foreground=white background=#ff0000 text="White text on red background"]]
cs: \[[!color foreground=white background=#ff0000 text="Bílý text na červeném pozadí"]]

source: The background color is missing, so the text is displayed on default background:
cs: Zde není uvedena barva pozadí, tudíž se použije výchozí barva pozadí:

source: \[[!color foreground=white text="White text on default color background"]]
cs: \[[!color foreground=white text="Bílý text na výchozím pozadí"]]

source: The foreground is missing, so the text has the default foreground color:
cs: Zde není uvedena barva popředí (textu), tudíž se použije výchozí barva popředí:

source: \[[!color background=#ff0000 text="Default color text on red background"]]
cs: \[[!color background=#ff0000 text="Výchozí barva textu na červeném pozadí"]]
