Repository: digideskio/ikiwiki
Catalog: po/underlays/directives/ikiwiki/directive/comment.*.po
Languages: cs

source: The `comment` directive is supplied by the [[!iki plugins/comments desc=comments]] plugin, and is used to add a comment to a page. Typically, the directive is the only thing on a comment page, and is filled out by the comment plugin when a user posts a comment.
cs: Direktiva `comment` je poskytována modulem [[!iki plugins/comments desc=comments]] a používá se pro přidání komentáře ke stránce. Typicky bývá tato direktiva jediná věc na stránce s komentáři a je vyplněna komentářovým modulem v případě, že uživatel zašle komentář.

source: Example:
cs: Příklad:

source: \[[!comment format=mdwn username="foo" subject="Bar" date="2009-06-02T19:05:01Z" content="""
cs: \[[!comment format=mdwn username="Kdosi" subject="Cokoliv" date="2009-06-02T19:05:01Z" content="""

source: Blah blah. """
cs: Blá, blá, blá. """

source: usage
cs: Použití

source: The only required parameter is `content`, the others just add or override metadata of the comment.
cs: Jediným vyžadovaným parametrem je `content`, ostatní parametry pouze přidávají nebo přepisují metadata komentáře.

source: `content` - Text to display for the comment. Note that [[directives|ikiwiki/directive]] may not be allowed, depending on the configuration of the comment plugin.
cs: `content` - Text, který se má zobrazit jako komentář. V závislosti na nastavení komentářového modulu nemusí být [[direktivy|ikiwiki/directive]] povoleny.

source: `format` - Specifies the markup used for the content.
cs: `format` - Určuje značkovací jazyk použitý pro obsah komentáře.

source: `subject` - Subject for the comment.
cs: `subject` - Název komentáře.

source: `date` - Date the comment was posted. Can be entered in nearly any format, since it's parsed by [[!cpan TimeDate]]
cs: `date` - Datum odeslání komentáře. Může být zadán v téměř libovolném formátu, protože je zpracován modulem [[!cpan TimeDate]].

source: `username` - Used to record the username (or OpenID) of a logged in commenter.
cs: `username` - Používá se pro uchování uživatelského jména (nebo OpenID) přihlášeného autora komentáře.

source: `ip` - Can be used to record the IP address of a commenter, if they posted anonymously.
cs: `ip` - Lze použít pro uchování IP adresy autora komentáře (např. pokud komentují anonymně).

source: `claimedauthor` - Records the name that the user entered, if anonmous commenters are allowed to enter their (unverified) name.
cs: `claimedauthor` - Uchová jméno, které uživatel zadal v případě, že je anonymním komentátorům umožněno zadat jejich (neověřené) jméno.
