Repository: digideskio/ikiwiki
Catalog: po/underlays/directives/ikiwiki/directive/cutpaste.*.po
Languages: cs

source: The `copy`, `cut` and `paste` directives are supplied by the [[!iki plugins/cutpaste desc=cutpaste]] plugin.
cs: Direktivy `copy`, `cut` a `paste` jsou poskytovány modulem [[!iki plugins/cutpaste desc=cutpaste]].

source: With these directives you can store and recall pieces of text in a page:
cs: Pomocí těchto direktiv můžete ukládat a opětovně vyvolávat části stránky:

source: `\[[!cut id=name text="text"]]` memorizes the text allowing to recall it using the given ID. The text being cut is not included in the output.
cs: `\[[!cut id=jméno text="text"]]` si zapamatuje text, který je možné později vyvolat zadaným identifikátorem. Vyjmutý text se ve stránce nezobrazí.

source: `\[[!copy id=name text="text"]]` memorizes the text allowing to recall it using the given ID. The text being cut *is* included in the output.
cs: `\[[!copy id=jméno text="text"]]` si zapamatuje text, který je možné později vyvolat zadaným identifikátorem. Zkopírovaný text se ve stránce *zobrazí*.

source: `\[[!paste id=name]]` is replaced by the previously memorized text.
cs: `\[[!paste id=jméno]]` se nahradí dříve zapamatovaným textem.

source: The text being cut, copied and pasted can freely include wiki markup, including more calls to cut, copy and paste.
cs: Kopírovaný/vkládaný text může obsahovat libovolné wiki značky, včetně dalšího volání direktiv `cut`, `copy` a `paste`.

source: You do not need to memorize the text before using it: a cut directive can follow the paste directive that uses its text. In fact, this is quite useful to postpone big blocks of text like long annotations and have a more natural flow. For example:
cs: Text si nemusíte zapamatovat před tím, než jej použijete. Direktiva `cut` může následovat až za direktivou `paste`, která využívá její text. To se hodí v případech, kdy chcete zachovat přirozený tok textu, ale potřebujete do něj vložit větší text, jako třeba anotaci. Například:

source: [...some time later...]
cs: [...o něco později...]

source: blah blah blah
cs: blá, blá, blá

source: This can potentially be used to create loops, but ikiwiki is clever and breaks them.
cs: To by potenciálně mohlo vést k zacyklení, ale ikiwiki je chytrá a nekonečné smyčky přeruší.

source: Since you can paste without using double quotes, copy and paste can be used to nest directives that require multiline parameters inside each other:
cs: Protože můžete vkládat text bez použití dvojitých uvozovek, můžete použít copy a paste pro vnořování direktiv, které vyžadují víceřádkové parametry.

source: multiline parameter!
cs: víceřádkový parametr!
