Repository: digideskio/ikiwiki
Catalog: po/underlays/directives/ikiwiki/directive/if.*.po
Languages: cs

source: The `if` directive is supplied by the [[!iki plugins/conditional desc=conditional]] plugin.
cs: Direktiva `if` je poskytována modulem [[!iki plugins/conditional desc=conditional]].

source: With this directive, you can make text be conditionally displayed on a page. For example:
cs: Pomocí této direktivy můžete na stránce zobrazovat text v závislosti na splnění nějaké podmínky. Například:

source: \[[!if test="enabled(smiley)" then="The smiley plugin is enabled :-)" else="No smiley plugin here.."]]
cs: \[[!if test="enabled(smiley)" then="Modul smiley je povolen :-)" else="Bez modulu smiley..."]]

source: If the specified `test` succeeds, the `then` text will be displayed, otherwise the `else` text will be displayed. The `else` part is optional.
cs: Pokud je zadaný `test` splněn, zobrazí se text v parametru `then`, jinak se zbobrazí text v parametru `else`. Parametr `else` je volitelný.

source: The `then` and `else` values can include any markup that would be allowed in the wiki page outside the template. Triple-quoting the values even allows quotes to be included.
cs: Hodnoty v parametrech `then` a `else` mohou obsahovat libovolné značky, které jsou povoleny na běžné wiki stránce. Trojité uvozovky dokonce umožňují použít uvnitř hodnoty (anglické) uvozovky.

source: The `test` is a [[ikiwiki/PageSpec]]; if it matches any page in the wiki then it succeeds. So you can do things like testing for the existence of a page or pages, testing to see if any pages were created in a given month, and so on.
cs: `test` je vlastně [[ikiwiki|PageSpec]]. Pokud vyhovuje alespoň jedna stránka, test uspěl. Můžete tak testovat přítomnost stránky nebo stránek, zjišťovat, jestli byly nějaké stránky vytvořeny v daném měsíci, a podobně.

source: If you want the [[ikiwiki/PageSpec]] to only match against the page that contains the conditional, rather than matching against all pages in the wiki, set the "all" parameter to "no".
cs: Chcete-li, aby se [[ikiwiki/PageSpec]] testovalo pouze na stránce obsahující podmínku a ne na všech stránkách ve wiki, nastavte parametr „all“ na hodnotu „no“.

source: In an `if` directive, the regular [[ikiwiki/PageSpec]] syntax is expanded with the following additional tests:
cs: V direktivě `if` je běžná syntaxe [[ikiwiki/PageSpec]] rozšířena o následující testy:

source: enabled(plugin)
cs: enabled(modul)

source: Tests whether the specified plugin is enabled.
cs: Testuje, zda je zadaný modul povolen.

source: sourcepage(glob)
cs: sourcepage(vzor)

source: Tests whether the glob matches the name of the page that contains the conditional.
cs: Testuje, zda se vzor shoduje s názvem stránky, která obsahuje podmínku.

source: destpage(glob)
cs: destpage(vzor)

source: Tests whether the glob matches the name of the page that is being built. That might be different than the name of the page that contains the conditional, if it's being inlined into another page.
cs: Testuje zda se vzor shoduje s názvem stránky, která se právě sestavuje. To může být odlišné od názvu stránky, která obsahuje podmínku, např. pokud je stránka vložena do jiné stránky.

source: Tests whether the page is being included onto another page.
cs: Testuje, zda je stránka vložena do jiné stránky.
