Repository: digideskio/ikiwiki
Catalog: po/underlays/directives/ikiwiki/directive/img.*.po
Languages: cs

source: The `img` directive is supplied by the [[!iki plugins/img desc=img]] plugin.
cs: Direktiva `img` je poskytována modulem [[!iki plugins/img desc=img]].

source: This is an image handling directive. While ikiwiki supports inlining full-size images by making a [[ikiwiki/WikiLink]] that points to the image, using this directive you can easily scale down an image for inclusion onto a page, providing a link to a full-size version.
cs: Tato direktiva se stará o správu obrázků. Ikiwiki sice podporuje vkládání obrázků pomocí [[wiki odkazů|ikiwiki/WikiLink]], které se odkazují na soubory s obrázky, nicméně pomocí této direktivy můžete obrázky na stránce zmenšit a poskytnout odkaz na jejich plnoformátovou verzi.

source: usage
cs: Použití

source: \[[!img image1.jpg size="200x200" alt="clouds"]]
cs: \[[!img image1.jpg size="200x200" alt="oblaka"]]

source: The image file will be searched for using the same rules as used to find the file pointed to by a [[ikiwiki/WikiLink]].
cs: Soubor s obrázkem se bude hledat podle stejných pravidel, jako kdybyste použili [[wiki odkaz|ikiwiki/WikiLink]].

source: The `size` parameter is optional, defaulting to full size. Note that the original image's aspect ratio is always preserved, even if this means making the image smaller than the specified size. You can also specify only the width or the height, and the other value will be calculated based on it: "200x", "x200"
cs: Parametr `size` je volitelný, implicitně ponechá obrázek v plné velikosti. Poměr stran původního obrázku je vždy zachován, i za cenu zmenšení obrázku oproti zadaným hodnotám. Můžete také zadat pouze šířku nebo výšku a druhá hodnota bude dopočítána automaticky: „200x“ resp. „x200“.

source: You can also pass `alt`, `title`, `class`, `align` and `id` parameters. These are passed through unchanged to the html img tag. If you include a `caption` parameter, the caption will be displayed centered beneath the image.
cs: Dále můžete použít parametry `alt`, `title`, `class`, `align` a `id`, které budou beze změny předány do html značky img. Použijete-li parametr `caption`, zobrazí se tento popis vystředěně pod obrázkem.

source: The `link` parameter is used to control whether the scaled down image links to the full size version. By default it does; set "link=somepage" to link to another page instead, or "link=no" to disable the link, or "link=http://url" to link to a given url.
cs: Parametr `link` určuje, zda mají škálované obrázky odkazovat na původní verzi (což je výchozí chování). Nastavením „link=no“ odkaz zakážete, použitím „link=stránka“ se místo původního obrázku odkážete na jinou stránku a pomocí „link=http://url“ se odkážete na zadané url.

source: You can also set default values that will be applied to all later images on the page, unless overridden. Useful when including many images on a page.
cs: Také je možné nastavit výchozí hodnoty, které se použijí pro všechny následující obrázky na stránce (pokud je nepřepíšete ručně), což je obzvláště užitečné v případech, kdy na stránku vkládáte větší množství obrázků.

source: \[[!img defaults size=200x200 alt="wedding photo"]] \[[!img photo1.jpg]] \[[!img photo2.jpg]] \[[!img photo3.jpg size=200x600]]
cs: \[[!img defaults size=200x200 alt="svatební foto"]] \[[!img photo1.jpg]] \[[!img photo2.jpg]] \[[!img photo3.jpg size=200x600]]
