Repository: digideskio/ikiwiki
Catalog: po/underlays/directives/ikiwiki/directive/inline.*.po
Languages: cs

source: The `inline` directive is supplied by the [[!iki plugins/inline desc=inline]] plugin.
cs: Direktiva `inline` je poskytována modulem [[!iki plugins/inline desc=inline]].

source: This is a directive that allows including one wiki page inside another. The most common use of inlining is generating blogs and RSS or Atom feeds.
cs: Tato direktiva umožňuje vkládat jednu wiki stránku do druhé. Vkládání se nejčastěji používá pro generování blogů a RSS nebo Atom kanálů.

source: Example:
cs: Příklad:

source: Any pages that match the specified [[PageSpec]] (in the example, any [[SubPage]] of "blog") will be part of the blog, and the newest 10 of them will appear in the page. Note that if files that are not pages match the [[PageSpec]], they will be included in the feed using RSS enclosures, which is useful for podcasting.
cs: Všechny stránky, které odpovídají zadané [[speficikaci stránek|PageSpec]] (v příkladu libovolná [[podstránka|SubPage]] adresáře „blog“) budou součástí blogu a na stránce se zobrazí 10 nejnovějších článků. Pokud zadané [[speficikaci stránek|PageSpec]] vyhovují soubory, které nejsou stránkami, budou do kanálu vloženy pomocí RSS elementu enclosure. Toho se dá využít pro podcasting.

source: The optional `rootpage` parameter tells the wiki that new posts to this blog should default to being [[SubPages|SubPage]] of "blog", and enables a form at the top of the blog that can be used to add new items.
cs: Volitelný parametr `rootpage` informuje wiki, že nové články tohoto blogu mají být [[podstránky|SubPage]] stránky „blog“ a také nad blogem aktivuje formulář, který lze použít pro přidávání nových článků.

source: If you want your blog to have an archive page listing every post ever made to it, you can accomplish that like this:
cs: Pokud ve svém blogu chcete stránku, která by vypisovala úplně všechny články, které jste kdy vytvořili, můžete použít:

source: You can even create an automatically generated list of all the pages on the wiki, with the most recently added at the top, like this:
cs: Obdobně můžete vytvořit automaticky generovaný seznam všech stránek ve wiki (nejnovější stránky jsou nahoře):

source: If you want to be able to add pages to a given blog feed by tagging them, you can do that too. To tag a page, just make it link to a page or pages that represent its tags. Then use the special `link()` [[PageSpec]] to match all pages that have a given tag:
cs: Chcete-li přidávat do blogovacího kanálu stránky na základě štítků, žádný problém. Pro přidání štítku na stránku jednoduše na stránce vytvořte odkaz na stránku nebo stránky reprezentující požadované štítky. Poté můžete vybrat stránky s daným štítkem pomocí speciální [[specifikace stránky|PageSpec]] `link()`:

source: \[[!inline pages="link(life)"]]
cs: \[[!inline pages="link(život)"]]

source: Or include some tags and exclude others:
cs: Nebo vybrat některé štítky a ignorovat jiné:

source: usage
cs: Použití

source: There are many parameters you can use with the `inline` directive. These are the commonly used ones:
cs: V direktivě `inline` lze použít mnoho parametrů, tyto jsou nejpoužívanější:

source: `pages` - A [[PageSpec]] of the pages to inline.
cs: `pages` - [[Specifikace stránek|PageSpec]], které se mají vložit.

source: `show` - Specify the maximum number of matching pages to inline. Default is 10, unless archiving, when the default is to show all. Set to 0 to show all matching pages.
cs: `show` - Zadá maximální počet stránek, které se mají vložit. Výchozí hodnota je 10 (s výjimkou archivování, kdy se implicitně zobrazují všechny stránky). Pro zobrazení všech stránek odpovídajících specifikaci použijte hodnotu „0“.

source: `archive` - If set to "yes", only list page titles and some metadata, not full contents.
cs: `archive` - Má-li hodnotu „yes“ nezobrazí se celý obsah, ale pouze názvy stránek a nějaká metadata.

source: `description` - Sets the description of the rss feed if one is generated. Defaults to the name of the wiki.
cs: `description` - Pokud se generuje RSS kanál, nastaví jeho popis. Výchozí hodnotou je název wiki.

source: `skip` - Specify a number of pages to skip displaying. Can be useful to produce a feed that only shows archived pages.
cs: `skip` - Určuje počet stránek, které se mají přeskočit. Může být užitečné pro vytvoření kanálu, který zobrazuje pouze archivované stránky.

source: `postform` - Set to "yes" to enable a form to post new pages to a blog.
cs: `postform` - Nastavení na „yes“ povolí formulář pro vkládání nových stránek do blogu.

source: `postformtext` - Set to specify text that is displayed in a postform.
cs: `postformtext` - Text, který se má zobrazit ve formuláři pro přidání nového článku.

source: `rootpage` - Enables the postform, and allows controling where newly posted pages should go, by specifiying the page that they should be a [[SubPage]] of.
cs: `rootpage` - Povolí formulář pro přidání nového článku a zároveň určuje, kam se mají nové stránky ukládat, protože tyto budou [[podstránky|SubPage]] zadané stránky.

source: Here are some less often needed parameters:
cs: Následují některé méně používané parametry:

source: `actions` - If set to "yes" add links to the bottom of the inlined pages for editing and discussion (if they would be shown at the top of the page itself).
cs: `actions` - Má-li hodnotu „yes“, přidá do spodní části vložených stránek odkazy pro úpravu a diskusi (pokud by byly tyto prvky zobrazeny v záhlaví samotné stránky).

source: `rss` - controls generation of an rss feed. If the wiki is configured to generate rss feeds by default, set to "no" to disable. If the wiki is configured to `allowrss`, set to "yes" to enable.
cs: `rss` - Povoluje vytváření rss kanálu. Pokud je wiki nastavená, aby vytvářela rss kanály automaticky, můžete to nastavením na „no“ potlačit. Pokud je wiki nastavená s hodnotou `allowrss` můžete rss povolit hodnotou „yes“.

source: `atom` - controls generation of an atom feed. If the wiki is configured to generate atom feeds by default, set to "no" to disable. If the wiki is configured to `allowatom`, set to "yes" to enable.
cs: `rss` - Povoluje vytváření atom kanálu. Pokud je wiki nastavená, aby vytvářela atom kanály automaticky, můžete to nastavením na „no“ potlačit. Pokud je wiki nastavená s hodnotou `allowatom` můžete atom povolit hodnotou „yes“.

source: `feeds` - controls generation of all types of feeds. Set to "no" to disable generating any feeds.
cs: `feeds` - Řídí vytváření všech typů kanálů. Hodnotou „no“ zakážete vytváření kanálů.

source: `emptyfeeds` - Set to "no" to disable generation of empty feeds. Has no effect if `rootpage` or `postform` is set.
cs: `emptyfeeds` - Nastavením na „no“ zakážete vytváření prázdných kanálů. Pokud je použit parametr `rootpage` nebo `postform`, nedělá nic.

source: `template` - Specifies the template to fill out to display each inlined page. By default the `inlinepage` template is used, while the `archivepage` template is used for archives. Set this parameter to use some other, custom template, such as the `titlepage` template that only shows post titles or the `microblog` template, optimised for microblogging. Note that you should still set `archive=yes` if your custom template does not include the page content.
cs: `template` - Určuje šablonu, která se má použít pro zobrazení každé vložené stránky. Implicitně se používá šablona `inlinepage` a pro archivy šablona `archivepage`. Pro použití jiné šablony nastavte tento parametr na její název. Například `titlepage`zobrazí pouze názvy článků, `microblog` je šablona optimalizovaná pro mikroblogování. Jestliže vaše specializovaná šablona nezobrazuje obsah stránky, měli byste také nastavit `archive=yes`.

source: `raw` - Rather than the default behavior of creating a blog, if raw is set to "yes", the page will be included raw, without additional markup around it, as if it were a literal part of the source of the inlining page.
cs: `raw` - Na rozdíl od výchozího chování, kdy se vytváří blog, se při nastavení raw na „yes“ vloží stránky bez dodatečných dekorací okolo, taže to vypadá, jako by byly nedělitelnou součástí stránky, do které jsou vkládány.

source: `sort` - Controls how inlined pages are sorted. The default, "age" is to sort newest created pages first. Setting it to "title" will sort pages by title, and "mtime" sorts most recently modified pages first. If [[!cpan Sort::Naturally]] is installed, `sort` can be set to "title_natural" to sort by title with numbers treated as such ("1 2 9 10 20" instead of "1 10 2 20 9").
cs: `sort` - Určuje řazení vložených stránek. Výchozí je „age“, což řadí nejnovější stránky jako první. Nastavení „title“ seřadí stránky abecedně dle názvu a „mtime“ na první místa dosadí stránky, které byly nedávno změněny. Pokud je nainstalován modul [[!cpan Sort::Naturally]], můžete použít řazení „title_natural“, které řadí dle názvu, ale čísla jsou řazena přirozeně „1 2 9 10 20“ místo lexikograficky „1 10 2 20 9“.

source: `reverse` - If set to "yes", causes the sort order to be reversed.
cs: `reverse` - Nastavení na hodnotu „yes“ obrátí způsob řazení.

source: `feedshow` - Specify the maximum number of matching pages to include in the rss/atom feeds. The default is the same as the `show` value above.
cs: `feedshow` - Zadá maximální počet stránek, které se mají zahrnout do rss/atom kanálů. Výchozí hodnota se bere z parametru `show` výše.

source: `feedonly` - Only generate the feed, do not display the pages inline on the page.
cs: `feedonly` - Nezobrazuje vložené stránky, pouze vygeneruje kanál.

source: `quick` - Build archives in quick mode, without reading page contents for metadata. By default, this also turns off generation of any feeds.
cs: `quick` - Vytvoří archiv v „rychlém“ režimu - ve stránkách nehledá metadata. Implicitně se tím také vypne generování kanálů.

source: `timeformat` - Use this to specify how to display the time or date for pages in the blog. The format string is passed to the strftime(3) function.
cs: `timeformat` - Určuje, jak se má v blogu zobrazit datum nebo čas. Formátovací řetězec se předá funkci strftime(3).

source: `feedpages` - A [[PageSpec]] of inlined pages to include in the rss/atom feeds. The default is the same as the `pages` value above, and only pages matched by that value are included, but some of those can be excluded by specifying a tighter [[PageSpec]] here.
cs: `feedpages` - [[Specifikace stránek|PageSpec]], které se mají vložit do rss/atom kanálů. Výchozí hodnota se bere z parametru `pages` výše, nicméně zde můžete definovat přísnější [[PageSpec]] a vyřadit tak některé stránky.

source: `guid` - If a URI is given here (perhaps a UUID prefixed with `urn:uuid:`), the Atom feed will have this as its `<id>`. The default is to use the URL of the page containing the `inline` directive.
cs: `guid` - Pokud zde zadáte URI (volitelně s UUID prefixem `urn:uuid:`), použije ho Atom jako své `<id>`. Ve výchozím nastavení se použije URL stránky obsahující direktivu `inline`.

source: `feedfile` - Can be used to change the name of the file generated for the feed. This is particularly useful if a page contains multiple feeds. For example, set "feedfile=feed" to cause it to generate `page/feed.atom` and/or `page/feed.rss`. This option is not supported if the wiki is configured not to use `usedirs`.
cs: `feedfile` - Slouží pro změnu jména souboru, do kterého se generuje obsah kanálu, což se hodí, pokud stránka stránka obsahuje více kanálů. Například „feedfile=denicek“ by vytvořil soubory `stranka/denicek.atom` a/nebo `stranka/denicek.rss`. Tato volba není dostupná v případě, že wiki nemá povoleno použití `usedirs`.

source: `pagenames` - If given instead of `pages`, this is interpreted as a space-separated list of links to pages (with the same [[SubPage/LinkingRules]] as in a [[ikiwiki/WikiLink]]), and they are inlined in exactly the order given: the `sort` and `pages` parameters cannot be used in conjunction with this one.
cs: `pagenames` - Pokud je použito místo `pages`, interpretuje se jako mezerami oddělený seznam odkazů na stránky, které se mají vložit. Platí zde stejná [[pravidla vytváření odkazů|SubPage/LinkingRules]] jako u [[wiki odkazů|ikiwiki/WikiLink]] a jsou vloženy přesně v zadaném pořadí: parametry `sort` a `pages` nelze použít.

source: A related directive is the [[ikiwiki/directive/edittemplate]] directive, which allows default text for a new page to be specified.
cs: Příbuznou direktivou je direktiva [[ikiwiki/directive/edittemplate]], která umožňuje definovat výchozí text pro nové stránky.
