Repository: digideskio/ikiwiki
Catalog: po/underlays/directives/ikiwiki/directive/meta.*.po
Languages: cs

source: The `meta` directive is supplied by the [[!iki plugins/meta desc=meta]] plugin.
cs: Direktiva `meta` je poskytována modulem [[!iki plugins/meta desc=meta]].

source: This directive allows inserting arbitrary metadata into the source of a page. Enter the metadata as follows:
cs: Direktiva umožňuje do zdrojové stránky vkládat libovolná metadata. Syntaxe je následující:

source: \[[!meta field="value"]] \[[!meta field="value" param="value" param="value"]]
cs: \[[!meta pole="hodnota"]] \[[!meta pole="hodnota" param="hodnota" param="hodnota"]]

source: The first form sets a given field to a given value, while the second form also specifies some additional sub-parameters.
cs: První způsob nastaví dané pole na zadanou hodnotu, druhý pak přidává nějaké další parametry.

source: The field values are treated as HTML entity-escaped text, so you can include a quote in the text by writing `&quot;` and so on.
cs: Hodnoty polí jsou považovány za HTML text, takže můžete používat entity jako `&quot;` místo uvozovek a podobně.

source: Supported fields:
cs: Podporovaná pole:

source: Overrides the title of the page, which is generally the same as the page name.
cs: Přepíše název stránky, který je obvykle stejný jako jméno stránky.

source: Note that if the title is overridden, a "title_overridden" variable will be set to a true value in the template; this can be used to format things differently in this case.
cs: Pokud je název stránky přepsán, nastaví se v šabloně proměnná „title_overridden“ na hodnotu true; toho můžete využít například pro odlišné formátování takovýchto stránek.

source: Specifies a license for the page, for example, "GPL". Can contain WikiLinks and arbitrary markup.
cs: Zadá licenci stránky, například „GPL“. Může obsahovat wiki odkazy a libovolné značkovací příkazy.

source: Specifies the copyright of the page, for example, "Copyright 2007 by Joey Hess". Can contain WikiLinks and arbitrary markup.
cs: Zadá copyright stránky, například „Copyright 2007 by Joey Hess“. Může obsahovat wiki odkazy a libovolné značkovací příkazy.

source: Specifies the author of a page.
cs: Zadá autora stránky.

source: Specifies an url for the author of a page.
cs: Zadá url autora stránky.

source: Specifies a "description" of the page. You could use this to provide a summary, for example, to be picked up by the [[map]] directive.
cs: Zadá „popis“ stránky. Můžete sem zadat krátkou anotaci, kterou pak využijete například v direktivě [[map]].

source: Specifies a permanent link to the page, if different than the page generated by ikiwiki.
cs: Zadá permanentní odkaz na stránku - například pokud je jiný, než stránka vygenerovaná ikiwiki.

source: Specifies the creation date of the page. The date can be entered in nearly any format, since it's parsed by [[!cpan TimeDate]].
cs: Zadá datum vytvoření stránky. Datum je možno zadat v téměř libovolném formátu, protože je zpracováno perlovým modulem [[!cpan TimeDate]].

source: Adds a stylesheet to a page. The stylesheet is treated as a wiki link to a `.css` file in the wiki, so it cannot be used to add links to external stylesheets. Example:
cs: Přidá do stránky odkaz na soubor se stylem. Styl je chápán jako wiki odkaz na `.css` soubor, tudíž takto nelze přidávat odkazy na externí styly. Příklad:

source: \[[!meta stylesheet=somestyle rel="alternate stylesheet" title="somestyle"]]
cs: \[[!meta stylesheet=mujstyl rel="alternate stylesheet" title="mujstyl"]]

source: Adds html &lt;link&gt; tags to perform OpenID delegation to an external OpenID server. This lets you use an ikiwiki page as your OpenID.
cs: Přidá html značky &lt;link&gt;, aby delegoval OpenID na externí OpenID server. Tímto můžete použít stránku v ikiwiki jako své OpenID.

source: By default this will delegate for both `openid` and `openid2`. To only delegate for one, add a parameter such as `delegate=openid`.
cs: Implicitně se deleguje `openid` i `openid2`. Chcete-li delegovat pouze jedno z nich, přidejte parametr `delegate`, např `delegate=openid`.

source: An optional `xrds-location` parameter lets you specify the location of any [eXtensible Resource DescriptorS](http://www.windley.com/archives/2007/05/using_xrds.shtml).
cs: Volitelný parametr `xrds-location` vám umožní zadat umístění libovolných [eXtensible Resource DescriptorS](http://www.windley.com/archives/2007/05/using_xrds.shtml).

source: Example:
cs: Příklad:

source: Specifies a link to another page. This can be used as a way to make the wiki treat one page as linking to another without displaying a user-visible [[ikiwiki/WikiLink]]:
cs: Vytvoří odkaz na jinou stránku. Toho se dá využít pro to, aby ikiwiki věděla, že stránka odkazuje na jinou stránku, ale přitom se nezobrazil viditelný [[wiki odkaz|ikiwiki/WikiLink]]:

source: \[[!meta link=otherpage]]
cs: \[[!meta link=jinastranka]]

source: It can also be used to insert a html &lt;link&gt; tag. For example:
cs: Také se dá využít pro vložení html značky &lt;link&gt;. Například:

source: However, this latter syntax won't be allowed if the [[!iki plugins/htmlscrubber desc=htmlscrubber]] plugin is enabled, since it can be used to insert unsafe content.
cs: Tato druhá syntaxe bude fungovat pouze pokud máte povolený také modul [[!iki plugins/htmlscrubber desc=htmlscrubber]], protože jinak byste mohli do stránky vložit nebezpečný obsah.

source: Causes the page to redirect to another page in the wiki.
cs: Přesměruje návštěvníky na jinou stránku ve wiki.

source: \[[!meta redir=otherpage]]
cs: \[[!meta redir=jinastranka]]

source: Optionally, a delay (in seconds) can be specified. The default is to redirect without delay.
cs: Volitelně můžete přidat zpoždění (v sekundách) parametrem `delay`. Implicitně se přesměrovává bez zpoždění.

source: It can also be used to redirect to an external url. For example:
cs: Je možné přesměrování i na externí url. Například:

source: \[[!meta redir="http://example.com/"]]
cs: \[[!meta redir="http://www.debian.org/"]]

source: For both cases, an anchor to jump to inside the destination page may also be specified using the common `#ANCHOR` syntax.
cs: V obou případech je možné skočit na konkrétní místo v cílové stránce (kotvu) pomocí běžné syntaxe `#KOTVA`.

source: Causes the robots meta tag to be written:
cs: Zapíše metaznačku pro webové roboty:

source: Valid values for the attribute are: "index", "noindex", "follow", and "nofollow". Multiple comma-separated values are allowed, but obviously only some combinations make sense. If there is no robots meta tag, "index, follow" is used as the default.
cs: Platné hodnoty jsou: „index“, „noindex“, „follow“ a „nofollow“. Je povoleno více hodnot oddělených čárkou, ale smysl mají pochopitelně pouze některé kombinace. Pokud ve stránce žádná metaznačka robots není, použije se automaticky „index, follow“.

source: The value is escaped, but its contents are not otherwise checked.
cs: Hodnota je chráněná proti nebezpečným znakům, ale jinak se samotný obsah nijak nekontroluje.

source: Specifies a globally unique ID for a page. This guid should be a URI (in particular, it can be `urn:uuid:` followed by a UUID, as per [[!rfc 4122]]), and it will be used to identify the page's entry in RSS and Atom feeds. If not given, the default is to use the page's URL as its guid.
cs: Zadává globálně jedinečné ID stránky. guid by mělo být URI (konkrétně to může být `urn:uuid:` následované UUID dle [[!rfc 4122]]) a použije se pro identifikaci stránky v RSS a Atom kanálech. Není-li zadáno, použije se jako guid URL stránky.

source: This is mostly useful when a page has moved, to keep the guids for pages unchanged and avoid_flooding_aggregators (see [[!iki tips/howto_avoid_flooding_aggregators]]).
cs: Zachování guid se hodí převážně při přesunu stránek na jiné místo, když chcete předejít zaplavení agregátorů (vizte [[!iki tips/howto_avoid_flooding_aggregators]]).

source: Specifies a fake modification time for a page, to be output into RSS and Atom feeds. This is useful to avoid flooding aggregators that sort by modification time, like Planet: for instance, when editing an old blog post to add tags, you could set `updated` to be one second later than the original value. The date/time can be given in any format that [[!cpan TimeDate]] can understand, just like the `date` field.
cs: Pro RSS a Atom kanály použije falešný čas změny stránky. To se občas hodí jako prevence proti zaplavení agregátorů, které zobrazují články dle času změny (jako třeba Planeta). Například pokud do staršího blogu přidáváte štítky, můžete nastavit `updated` o jednu sekundu před původním časem. Datum/čas můžete stejně jako u jiných časových polí zadat v libovolném formátu, kterému rozumí modul [[!cpan TimeDate]].

source: If the field is not one of the above predefined fields, the metadata will be written to the generated html page as a &lt;meta&gt; header. However, this won't be allowed if the [[!iki plugins/htmlscrubber desc=htmlscrubber]] plugin is enabled, since it can be used to insert unsafe content.
cs: Pokud zadané pole není některé z předdefinovaných polí výše, zapíší se metadata do vygenerované html stránky jako hlavička &lt;meta&gt;. Aby to však fungovalo, musíte mít povolený modul [[!iki plugins/htmlscrubber desc=htmlscrubber]], protože jinak byste mohli do stránky vložit nebezpečný obsah.
