Repository: digideskio/ikiwiki
Catalog: po/underlays/directives/ikiwiki/directive/postsparkline.*.po
Languages: cs

source: The `postsparkline` directive is supplied by the [[!iki plugins/postsparkline desc=postsparkline]] plugin.
cs: Direktiva `postsparkline` je poskytována modulem [[!iki plugins/postsparkline desc=postsparkline]].

source: This directive uses the [[!iki plugins/sparkline desc=sparkline]] plugin to create a [[sparkline]] of statistics about a set of pages, such as posts to a blog.
cs: Tato direktiva vytváří [[sparkline]] statistiky o zadané množině stránek, například o článcích v blogu. Využívá k tomu modul [[!iki plugins/sparkline desc=sparkline]]

source: examples
cs: Příklady

source: Post interval: \[[!postsparkline pages="blog/* and !*/Discussion" max=100 formula=interval style=bar barwidth=2 barspacing=1 height=13]]
cs: Intervaly mezi články: \[[!postsparkline pages="blog/* and !*/Discussion" max=100 formula=interval style=bar barwidth=2 barspacing=1 height=13]]

source: Posts per month this year: \[[!postsparkline pages="blog/* and !*/Discussion" max=12 formula=permonth style=bar barwidth=2 barspacing=1 height=13]]
cs: Článků za měsíc v letošním roce: \[[!postsparkline pages="blog/* and !*/Discussion" max=12 formula=permonth style=bar barwidth=2 barspacing=1 height=13]]

source: usage
cs: Použití

source: You don't need to specify any data points (though you can if you want to). Instead, data points are automatically generated based on the creation times of pages matched by the specified `pages` [[ikiwiki/PageSpec]]. A maximum of `max` data points will be generated.
cs: Nemusíte (ale můžete) zadávat žádné datové body, protože ty se vygenerují automaticky na základě času vytvoření stránek vybraných pomocí [[ikiwiki/PageSpec]]. Datových bodů se vytvoří nejvýše `max`.

source: `interval` - The height of each point represents how long it has been since the previous post.
cs: `interval` - Výška každého bodu reprezentuje dobu od předchozího článku.

source: `perday` - Each point represents a day; the height represents how many posts were made that day.
cs: `perday` - Každý bod znamená jeden den a výška reprezentuje počet článků vytvořených toho dne.

source: `permonth` - Each point represents a month; the height represents how many posts were made that month.
cs: `permonth` - Každý bod znamená jeden měsíc a výška reprezentuje počet článků vytvořených v daném měsíci.

source: To change the color used to draw the sparkline, use the `color` parameter. For example, "color=red".
cs: Barvu sparkline můžete změnit parametrem `color`, například „color=red“.
