Repository: digideskio/ikiwiki
Catalog: po/underlays/directives/ikiwiki/directive/sparkline.*.po
Languages: cs

source: The `sparkline` directive is supplied by the [[!iki plugins/sparkline desc=sparkline]] plugin.
cs: Direktiva `sparkline` je poskytována modulem [[!iki plugins/sparkline desc=sparkline]].

source: examples
cs: Příklady

source: This creates a simple line graph, graphing several points. It will be drawn 40 pixels wide and 16 pixels high. The high point in the line has a green marker, and the low point has a red marker.
cs: Toto vytvoří jednoduchý čárový graf zobrazující několik bodů. Rozměry jsou 40 pixelů na šířku a 16 pixelů na výšku. Nejvyšší bod je označen zelenou značkou, nejnižší červenou.

source: This more complex example generates a bar graph. The bars are 2 pixels wide, and separated by one pixel, and the graph is 13 pixels tall. Width is determined automatically for bar graphs. The points with negative values are colored red, instead of the default black.
cs: Tento komplexnější příklad generuje sloupcový graf. Sloupce jsou široké 2 pixely a oddělené jednopixelovou mezerou. Šířka sloupcových grafů je vypočítána automaticky, na výšku má graf 13 pixelů. Body se zápornými hodnotami jsou obarveny červeně namísto výchozí černé.

source: usage
cs: Použití

source: The form for the data points is "x,y", or just "y" if the x values don't matter. Bar graphs can also add "(color)" to specify a color for that bar.
cs: Datové body mají formát „x,y“, případně jenom „y“, pokud na hodnotách x nezáleží. Sloupcové grafy mohou navíc změnit barvu sloupce přidáním „(barva)“.

source: The following named parameters are recognised. Most of these are the same as those used by the underlying sparkline library, which is documented in more detail in [its wiki](http://sparkline.wikispaces.com/usage).
cs: Rozpoznány jsou následující parametry. Většina z nich je shodná s parametry používanými v knihovně sparkline, která je podrobně zdokumentována v [její wiki](http://sparkline.wikispaces.com/usage).

source: `style` - Either "line" (the default) or "bar".
cs: `style` - Buď „line“ (čárový, výchozí) nebo „bar“ (sloupcový).

source: `width` - Width of the graph in pixels. Only needed for line graphs.
cs: `width` - Šířka grafu v pixelech. Vyžadováno pouze u čárových grafů.

source: `height` - Height of the graph in pixels. Defaults to 16.
cs: `height` - Výška grafu v pixelech. Výchozí hodnota je 16.

source: `barwidth` - Width of bars in a bar graph. Default is 1 pixel.
cs: `barwidth` - Šířka sloupců u sloupcového grafu. Výchozí hodnota je 1 pixel.

source: `barspacing` - Spacing between bars in a bar graph, in pixels. Default is 1 pixel.
cs: `barspacing` - Mezery mezi sloupci ve sloupcovém grafu. Výchozí je 1 pixel.

source: `ymin`, `ymax` - Minimum and maximum values for the Y axis. This is normally calculated automatically, but can be explicitly specified to get the same values for multiple related graphs.
cs: `ymin`, `ymax` - Minimální a maximální hodnoty osy Y. Obvykle se počítají automaticky, ale pokud máte třeba několik podobných grafů, můžete je chtít zadat ve všech grafech stejné.

source: `featurepoint` - Adds a circular marker to a line graph, with optional text. This can be used to label significant points.
cs: `featurepoint` - Do čárového grafu přidá kruhovou značku s volitelným textem. Můžete tak označit a pojmenovat význačné body.

source: The value is a comma-delimited list of parameters specifying the feature point: X value, Y value, color name, circle diameter, text (optional), and text location (optional). Example: `featurepoint="3,5,blue,3"`
cs: Hodnotou je čárkami oddělený seznam parametrů definující význačný bod: hodnota X, hodnota Y, název barvy, průměr kružnice, text (volitelný) a umístění textu (volitelné). Příklad: `featurepoint="3,5,blue,3"`

source: Available values for the text location are: "top", "right", "bottom", and "left".
cs: Možná umístění textu jsou: „top“, „right“, „bottom“ a „left“.
