Repository: digideskio/ikiwiki
Catalog: po/underlays/directives/ikiwiki/directive/table.*.po
Languages: cs

source: The `table` directive is supplied by the [[!iki plugins/table desc=table]] plugin.
cs: Direktiva `table` je poskytována modulem [[!iki plugins/table desc=table]].

source: This directive can build HTML tables from data in CSV (comma-separated values) or DSV (delimiter-separated values) format.
cs: Tato direktiva umí vytvářet HTML tabulky z dat ve formátech CSV (hodnoty oddělené čárkou) nebo DSV (hodnoty oddělené oddělovačem).

source: examples
cs: Příklady

source: Customer|Amount Fulanito|134,34 Menganito|234,56 Menganito|234,56
cs: Zákazník|Částka Fulanito|134,34 Menganito|234,56 Menganito|234,56

source: In this second example the `record1` page should be similar to:
cs: Ve druhém příkladu by měla stránka `record1` vypadat nějak takto:

source: "Title","Perl Best Practices" "Author","Damian Conway" "Publisher","O’Reilly"
cs: "Název","Perl Best Practices" "Autor","Damian Conway" "Vydavatel","O’Reilly"

source: To make a cell span multiple columns, follow it with one or more empty cells. For example:
cs: Má-li se buňka rozpínat přes více sloupců, přidejte za ni jednu nebo více prázdných buněk. Například:

source: left||right| a|b|c|d this cell spans 4 columns|||
cs: levá||pravá| a|b|c|d tato buňka okupuje 4 sloupce|||

source: usage
cs: Použití

source: `data` - Values for the table.
cs: `data` - Hodnoty pro tabulku.

source: `file` - A file in the wiki containing the data.
cs: `file` - Soubor ve wiki, který obsahuje data.

source: `format` - The format of the data, either "csv", "dsv", or "auto" (the default).
cs: `format` - Formát dat - buď „csv“, „dsv“ nebo „auto“ (výchozí).

source: * `delimiter` - The character used to separate fields. By default, DSV format uses a pipe (`|`), and CSV uses a comma (`,`). * `class` - A CSS class for the table html element. * `header` - By default, or if set to "row", the first data line is used as the table header. Set it to "no" to make a table without a header, or "column" to make the first column be the header.
cs: * `delimiter` - Znak pro oddělování polí. Ve výchozím nastavení používá formát DSV rouru (`|`) a CSV formát čárku (`,`). * `class` - CSS třída pro html element table. * `header` - Má-li hodnotu „row“, použije se první datový řádek jako hlavička tabulky (výchozí nastavení). Dále můžete použít hodnoty „column“, pro vytvoření hlavičky z prvního sloupce, nebo „no“ pro vytvoření tabulky bez hlavičky.
