Repository: digideskio/ikiwiki
Catalog: po/underlays/directives/ikiwiki/directive/toggle.*.po
Languages: cs

source: The `toggle` and `toggleable` directives are supplied by the [[!iki plugins/toggle desc=toggle]] plugin.
cs: Direktivy `toggle` a `toggleable` jsou poskytovány modulem [[!iki plugins/toggle desc=toggle]].

source: With these directives you can create links on pages that, when clicked, toggle display of other parts of the page.
cs: Pomocí těchto direktiv můžete na stránkách vytvářet odkazy, které po kliknutí zobrazí/skryjí jiné části stránky.

source: It uses javascript to accomplish this; browsers without javascript will always see the full page content.
cs: Pro tento trik se používá javascript. Prohlížeče bez javascriptu zobrazí vždy kompletní obsah stránky.

source: Example use:
cs: Příkad použití:

source: \[[!toggle id="ipsum" text="show"]]
cs: \[[!toggle id="ipsum" text="zobrazit"]]

source: [[!toggle id="ipsum" text="hide"]]
cs: [[!toggle id="ipsum" text="skrýt"]]

source: Note that you can include wiki markup in the toggleable text, including even additional toggles, as shown in the above example.
cs: V přepínaném textu můžete používat běžné značkovací příkazy včetně dalších direktiv pro přepínání, jak je ukázáno v předchozím příkladu.

source: Also, the toggle and the togglable definitions do not need to be next to each other, but can be located anywhere on the page. There can also be mutiple toggles that all toggle a single togglable.
cs: Direktivy toggle a toggleable se nemusí nacházet vedle sebe, ale mohou být umístěny kdekoliv na stránce. Také může existovat více přepínačů, které zobrazují/skrývají stejný text.

source: The id has a default value of "default", so can be omitted in simple cases.
cs: Parametr `id` má výchozí hodnotu „default“, takže v nejjednodušších případech můžete parametr vynechat.

source: If you'd like a toggleable to be displayed by default, and toggle to hidden, then pass a parameter "open=yes" when setting up the toggleable.
cs: Jestliže chcete, aby byl přepínaný text implicitně vidět a teprve přepnutím se skryl, použijte v direktivě toggleable parametr „open=yes“.
